
layer {
  name: "Input"
  type: "Input"
  top: "Input"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 10
      dim: 10
    }
  }
}

layer {
  name: "Reshape"
  type: "Reshape"
  bottom: "Input"
  top: "output"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 1
      dim: 4
    }
    axis: -1
  }
}
